{"_id":{"$oid":"65ed812de5be6ae77d724921"},"Title":"Lamhe","Description":"Viren (Anil Kapoor) comes to India, he is captivated by Pallavi (Sridevi). When he learns she's spoken for, he returns. When he gets the news of Pallavi and her husband dying and leaving their daughter Pooja (Sridevi) behind, Viren ensures she is taken care of.","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and many conflicts"},"Director":{"Name":"Yash Chopra","Birth":1930}}
{"_id":{"$oid":"65ed7eace5be6ae77d72491e"},"Title":"Piku","Description":"Piku Banerjee (Deepika Padukone) is an architect residing in Chittaranjan Park, Delhi with her 70-year-old widower father, Bhashkor (Amitabh Bachchan). Bhashkor is a hypochondriac with chronic constipation, who traces every problem to his bowel movements.","Genre":{"Name":"Comedy","Description":"The drama genre features stories with high stakes and many conflicts"},"Director":{"Name":"Shoojit Sircar","Birth":1965}}
{"_id":{"$oid":"65efae593a995b553d44cf21"},"Title":"Merry Christmas","Description":"Albert, grieving the recent loss of his mother, crosses paths with Maria on Christmas Eve. What starts as a chance encounter blossoms into a night of romance, only to be clouded by hidden agendas, secrets, and a series of startling revelations","__v":0}
{"_id":{"$oid":"65ed8076e5be6ae77d724920"},"Title":"Veer Zaara","Description":" Squadron Leader Veer Pratap Singh is a rescue pilot with the Indian Air Force, who risks his own life to save the lives of others. One day, on duty, he comes across a stranded Zaara... a girl from Pakistan. Zaara, a carefree, sprightly girl has come to India to fulfill her surrogate mother's dying wish","genre":{"Name":"Romantic","Description":"Romance films are love stories. They center around two protagonists exploring some of the elements of love like relationships, sacrifice, marriage, obsession, or destruction"},"Director":{"Name":"Yash Chopra","Birth":1931}}
{"_id":{"$oid":"65ed7b58e5be6ae77d72491b"},"Title":"3_Idiots","Description":"3 IDIOTS follows college best friends, Farhan (R. Madhavan) and Raju (Sharman Joshi), who drive down to Shimla in search for Rancho (Aamir Khan), their long-lost buddy. During their journey, they recall the times they shared together, the mischief they got up to, and all that they learned from Rancho.","Genre":{"Name":"drama","Description":"The drama genre features stories with high stakes and many conflicts"},"Director":{"Name":"Rajkumar Hirani","Birth":1962}}
{"_id":{"$oid":"65ed8416e5be6ae77d724924"},"Title":"Madras Cafe","Description":"An Indian intelligence agent journeys to a war-torn coastal island to break a resolute rebel group and meets a passionate journalist.","Genre":{"Name":"Thriller","Description":"Thriller is a genre of fiction with numerous, often overlapping, subgenres, including crime, horror, and detective fiction"},"Director":{"Name":"Shoojit Sircar","Birth":1965}}
{"_id":{"$oid":"65ed7dffe5be6ae77d72491d"},"Title":"Pk","Description":"An alien on Earth loses the only device he can use to communicate with his spaceship. His innocent nature and child-like questions force the country to evaluate the impact of religious views on people.","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and many conflicts"},"Director":{"Name":"Rajkumar Hirani","Birth":1962}}
{"_id":{"$oid":"65ed7cfae5be6ae77d72491c"},"Title":"Munna bhai","Description":"Based in Mumbai, the film follows Munna trying to please his father by pretending to be a doctor, but when a doctor, Asthana (Irani), exposes Munna's lies and tarnishes his father's honour, Munna enrolls in an Indian medical college with the help of Circuit.","Genre":{"Name":"comedy","Description":"A comedy film is a category of film that emphasizes humor. These films are designed to amuse audiences and make them laugh"},"Director":{"Name":"Rajkumar Hirani","Birth":1962}}
{"_id":{"$oid":"65ed7f95e5be6ae77d72491f"},"Title":"Devdas","Description":"Based on the 1917 novel of the same name by Sarat Chandra Chattopadhyay, the film narrates the story of Devdas Mukherjee (Khan), a wealthy law graduate who returns from London to marry his childhood friend, Parvati 'Paro' (Rai).","Genre":{"Name":"Romantic","Description":"Romance films are love stories. They center around two protagonists exploring some of the elements of love like relationships, sacrifice, marriage, obsession, or destruction"},"Director":{"Name":"Sanjay Leela Bhanshali","Birth":1965}}
